OdRxResourceLoader.loadString(OdRxObject!System.Runtime.CompilerServices.IsConst*,System.UInt32,System.UInt32,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Load the string identified by the ID and a hint. Queries the class for
OdRxResourceLoader and calls subLoadString() to do the actual loading.
\param pClass     [in]  Class to be queried.
\param id         [in]  Resource ID of the string.
\param sourceHint [in]  Resource ID hint.
\param result    [out]  Loaded string.
\returns
Result of the subLoadString() call for the queried class or eNotImplemented
if the subLoadString() is not implemented in the queried class.

OdRxResourceLoader.subLoadString(System.UInt32,System.UInt32,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Loads the string identified by the ID and a hint. Implementation is up to the
application.
\param id         [in]  Resource ID of the string.
\param sourceHint [in]  Resource ID hint.
\param result    [out]  Loaded string.
\returns
Result of the operation. Depends on implementation.